[Killed] BlockStatement
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:8:52
 /**
  * Sanitiza o código do item removendo caracteres perigosos
  */
-function sanitizeItemCodigo(value: string): string {
-  // Remove espaços em branco nas extremidades
-  let sanitized = value.trim();
-  
-  // Remove caracteres de controle e não imprimíveis
-  sanitized = sanitized.replace(/[\x00-\x1F\x7F]/g, '');
-  
-  // Remove tentativas de path traversal
-  sanitized = sanitized.replace(/\.\./g, '');
-  sanitized = sanitized.replace(/[\/\\]/g, '');
-  
-  // Remove caracteres SQL perigosos adicionais (redundante com prepared statements, mas seguro)
-  sanitized = sanitized.replace(/[';"\-\-]/g, '');
-  
-  // Remove tags HTML/XML (prevenção XSS)
-  sanitized = sanitized.replace(/<[^>]*>/g, '');
-  
-  return sanitized;
-}
+function sanitizeItemCodigo(value: string): string {}
 
 /**
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] MethodExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:10:19
  */
 function sanitizeItemCodigo(value: string): string {
   // Remove espaços em branco nas extremidades
-  let sanitized = value.trim();
+  let sanitized = value;
   
   // Remove caracteres de controle e não imprimíveis
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:13:53
   let sanitized = value.trim();
   
   // Remove caracteres de controle e não imprimíveis
-  sanitized = sanitized.replace(/[\x00-\x1F\x7F]/g, '');
+  sanitized = sanitized.replace(/[\x00-\x1F\x7F]/g, "Stryker was here!");
   
   // Remove tentativas de path traversal
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] Regex
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:17:33
   
   // Remove tentativas de path traversal
   sanitized = sanitized.replace(/\.\./g, '');
-  sanitized = sanitized.replace(/[\/\\]/g, '');
+  sanitized = sanitized.replace(/[^\/\\]/g, '');
   
   // Remove caracteres SQL perigosos adicionais (redundante com prepared statements, mas seguro)
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:20:47
   sanitized = sanitized.replace(/[\/\\]/g, '');
   
   // Remove caracteres SQL perigosos adicionais (redundante com prepared statements, mas seguro)
-  sanitized = sanitized.replace(/[';"\-\-]/g, '');
+  sanitized = sanitized.replace(/[';"\-\-]/g, "Stryker was here!");
   
   // Remove tags HTML/XML (prevenção XSS)
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] Regex
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:20:33
   sanitized = sanitized.replace(/[\/\\]/g, '');
   
   // Remove caracteres SQL perigosos adicionais (redundante com prepared statements, mas seguro)
-  sanitized = sanitized.replace(/[';"\-\-]/g, '');
+  sanitized = sanitized.replace(/[^';"\-\-]/g, '');
   
   // Remove tags HTML/XML (prevenção XSS)
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] Regex
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:23:33
   sanitized = sanitized.replace(/[';"\-\-]/g, '');
   
   // Remove tags HTML/XML (prevenção XSS)
-  sanitized = sanitized.replace(/<[^>]*>/g, '');
+  sanitized = sanitized.replace(/<[^>]>/g, '');
   
   return sanitized;
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] Regex
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:23:33
   sanitized = sanitized.replace(/[';"\-\-]/g, '');
   
   // Remove tags HTML/XML (prevenção XSS)
-  sanitized = sanitized.replace(/<[^>]*>/g, '');
+  sanitized = sanitized.replace(/<[>]*>/g, '');
   
   return sanitized;
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] BlockStatement
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:31:58
 /**
  * Valida formato do código do item
  */
-function isValidItemCodigoFormat(value: string): boolean {
-  // Permite apenas: letras e números
-  // Caracteres permitidos: A-Z, a-z, 0-9
-  const validPattern = /^[A-Za-z0-9]+$/;
-  return validPattern.test(value);
-}
+function isValidItemCodigoFormat(value: string): boolean {}
 
 /**
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] Regex
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:34:24
 function isValidItemCodigoFormat(value: string): boolean {
   // Permite apenas: letras e números
   // Caracteres permitidos: A-Z, a-z, 0-9
-  const validPattern = /^[A-Za-z0-9]+$/;
+  const validPattern = /[A-Za-z0-9]+$/;
   return validPattern.test(value);
 }
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ConditionalExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:46:7
 ): { valid: boolean; error?: string; data?: ItemInformacoesGeraisRequestDTO } {
   
   // 1. Verifica se itemCodigo foi fornecido
-  if (!data.itemCodigo) {
+  if (true) {
     return {
       valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ConditionalExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:46:7
 ): { valid: boolean; error?: string; data?: ItemInformacoesGeraisRequestDTO } {
   
   // 1. Verifica se itemCodigo foi fornecido
-  if (!data.itemCodigo) {
+  if (false) {
     return {
       valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ObjectLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:47:12
   
   // 1. Verifica se itemCodigo foi fornecido
   if (!data.itemCodigo) {
-    return {
-      valid: false,
-      error: 'Código do item é obrigatório',
-    };
+    return {};
   }
 
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:49:14
   if (!data.itemCodigo) {
     return {
       valid: false,
-      error: 'Código do item é obrigatório',
+      error: "",
     };
   }
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] BlockStatement
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:54:44
   }
 
   // 2. Valida tipo
-  if (typeof data.itemCodigo !== 'string') {
-    return {
-      valid: false,
-      error: 'Código do item deve ser uma string',
-    };
-  }
+  if (typeof data.itemCodigo !== 'string') {}
 
   // 3. Sanitiza
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] EqualityOperator
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:54:7
   }
 
   // 2. Valida tipo
-  if (typeof data.itemCodigo !== 'string') {
+  if (typeof data.itemCodigo === 'string') {
     return {
       valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] BlockStatement
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:65:31
   const sanitized = sanitizeItemCodigo(data.itemCodigo);
 
   // 4. Valida se não ficou vazio após sanitização
-  if (sanitized.length === 0) {
-    return {
-      valid: false,
-      error: 'Código do item inválido ou contém apenas caracteres não permitidos',
-    };
-  }
+  if (sanitized.length === 0) {}
 
   // 5. Valida tamanho máximo
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ConditionalExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:65:7
   const sanitized = sanitizeItemCodigo(data.itemCodigo);
 
   // 4. Valida se não ficou vazio após sanitização
-  if (sanitized.length === 0) {
+  if (false) {
     return {
       valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ConditionalExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:73:7
   }
 
   // 5. Valida tamanho máximo
-  if (sanitized.length > 16) {
+  if (false) {
     return {
       valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] EqualityOperator
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:73:7
   }
 
   // 5. Valida tamanho máximo
-  if (sanitized.length > 16) {
+  if (sanitized.length >= 16) {
     return {
       valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] EqualityOperator
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:81:7
   }
 
   // 6. Valida tamanho mínimo
-  if (sanitized.length < 1) {
+  if (sanitized.length <= 1) {
     return {
       valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ConditionalExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:81:7
   }
 
   // 6. Valida tamanho mínimo
-  if (sanitized.length < 1) {
+  if (true) {
     return {
       valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Survived] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:84:14
   if (sanitized.length < 1) {
     return {
       valid: false,
-      error: 'Código do item não pode estar vazio',
+      error: "",
     };
   }

[Killed] BlockStatement
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:89:44
   }
 
   // 7. Valida formato (caracteres permitidos)
-  if (!isValidItemCodigoFormat(sanitized)) {
-    return {
-      valid: false,
-      error: 'Código do item contém caracteres inválidos. Use apenas letras, números e caracteres básicos',
-    };
-  }
+  if (!isValidItemCodigoFormat(sanitized)) {}
 
   // 8. Validações adicionais de segurança
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ConditionalExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:89:7
   }
 
   // 7. Valida formato (caracteres permitidos)
-  if (!isValidItemCodigoFormat(sanitized)) {
+  if (false) {
     return {
       valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ObjectLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:90:12
 
   // 7. Valida formato (caracteres permitidos)
   if (!isValidItemCodigoFormat(sanitized)) {
-    return {
-      valid: false,
-      error: 'Código do item contém caracteres inválidos. Use apenas letras, números e caracteres básicos',
-    };
+    return {};
   }
 
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:92:14
   if (!isValidItemCodigoFormat(sanitized)) {
     return {
       valid: false,
-      error: 'Código do item contém caracteres inválidos. Use apenas letras, números e caracteres básicos',
+      error: "",
     };
   }
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:99:44
   // 8. Validações adicionais de segurança
   
   // Bloqueia tentativas óbvias de SQL injection
-  const sqlKeywords = ['SELECT', 'INSERT', 'UPDATE', 'DELETE', 'DROP', 'CREATE', 'ALTER', 'EXEC', 'UNION'];
+  const sqlKeywords = ['SELECT', 'INSERT', "", 'DELETE', 'DROP', 'CREATE', 'ALTER', 'EXEC', 'UNION'];
   const upperSanitized = sanitized.toUpperCase();
   for (const keyword of sqlKeywords) {
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:99:99
   // 8. Validações adicionais de segurança
   
   // Bloqueia tentativas óbvias de SQL injection
-  const sqlKeywords = ['SELECT', 'INSERT', 'UPDATE', 'DELETE', 'DROP', 'CREATE', 'ALTER', 'EXEC', 'UNION'];
+  const sqlKeywords = ['SELECT', 'INSERT', 'UPDATE', 'DELETE', 'DROP', 'CREATE', 'ALTER', 'EXEC', ""];
   const upperSanitized = sanitized.toUpperCase();
   for (const keyword of sqlKeywords) {
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] MethodExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:100:26
   
   // Bloqueia tentativas óbvias de SQL injection
   const sqlKeywords = ['SELECT', 'INSERT', 'UPDATE', 'DELETE', 'DROP', 'CREATE', 'ALTER', 'EXEC', 'UNION'];
-  const upperSanitized = sanitized.toUpperCase();
+  const upperSanitized = sanitized.toLowerCase();
   for (const keyword of sqlKeywords) {
     if (upperSanitized.includes(keyword)) {
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] BlockStatement
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:101:38
   // Bloqueia tentativas óbvias de SQL injection
   const sqlKeywords = ['SELECT', 'INSERT', 'UPDATE', 'DELETE', 'DROP', 'CREATE', 'ALTER', 'EXEC', 'UNION'];
   const upperSanitized = sanitized.toUpperCase();
-  for (const keyword of sqlKeywords) {
-    if (upperSanitized.includes(keyword)) {
-      return {
-        valid: false,
-        error: 'Código do item contém padrões não permitidos',
-      };
-    }
-  }
+  for (const keyword of sqlKeywords) {}
 
   // Bloqueia tentativas de command injection
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ConditionalExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:102:9
   const sqlKeywords = ['SELECT', 'INSERT', 'UPDATE', 'DELETE', 'DROP', 'CREATE', 'ALTER', 'EXEC', 'UNION'];
   const upperSanitized = sanitized.toUpperCase();
   for (const keyword of sqlKeywords) {
-    if (upperSanitized.includes(keyword)) {
+    if (true) {
       return {
         valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] ConditionalExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:102:9
   const sqlKeywords = ['SELECT', 'INSERT', 'UPDATE', 'DELETE', 'DROP', 'CREATE', 'ALTER', 'EXEC', 'UNION'];
   const upperSanitized = sanitized.toUpperCase();
   for (const keyword of sqlKeywords) {
-    if (upperSanitized.includes(keyword)) {
+    if (false) {
       return {
         valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:105:16
     if (upperSanitized.includes(keyword)) {
       return {
         valid: false,
-        error: 'Código do item contém padrões não permitidos',
+        error: "",
       };
     }
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Survived] ArrayDeclaration
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:111:29
   }
 
   // Bloqueia tentativas de command injection
-  const dangerousPatterns = [
-    '&&', '||', '|', '`', '$', '$(', '${',
-  ];
+  const dangerousPatterns = [];
   for (const pattern of dangerousPatterns) {
     if (sanitized.includes(pattern)) {

[Killed] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:112:17
 
   // Bloqueia tentativas de command injection
   const dangerousPatterns = [
-    '&&', '||', '|', '`', '$', '$(', '${',
+    '&&', '||', "", '`', '$', '$(', '${',
   ];
   for (const pattern of dangerousPatterns) {
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Killed] StringLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:112:27
 
   // Bloqueia tentativas de command injection
   const dangerousPatterns = [
-    '&&', '||', '|', '`', '$', '$(', '${',
+    '&&', '||', '|', '`', "", '$(', '${',
   ];
   for (const pattern of dangerousPatterns) {
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Survived] BlockStatement
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:114:44
   const dangerousPatterns = [
     '&&', '||', '|', '`', '$', '$(', '${',
   ];
-  for (const pattern of dangerousPatterns) {
-    if (sanitized.includes(pattern)) {
-      return {
-        valid: false,
-        error: 'Código do item contém caracteres não permitidos',
-      };
-    }
-  }
+  for (const pattern of dangerousPatterns) {}
 
   // Tudo válido

[Killed] ConditionalExpression
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:115:9
     '&&', '||', '|', '`', '$', '$(', '${',
   ];
   for (const pattern of dangerousPatterns) {
-    if (sanitized.includes(pattern)) {
+    if (true) {
       return {
         valid: false,
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit

[Survived] BlockStatement
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:115:38
     '&&', '||', '|', '`', '$', '$(', '${',
   ];
   for (const pattern of dangerousPatterns) {
-    if (sanitized.includes(pattern)) {
-      return {
-        valid: false,
-        error: 'Código do item contém caracteres não permitidos',
-      };
-    }
+    if (sanitized.includes(pattern)) {}
   }
 

[Survived] ObjectLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:116:14
   ];
   for (const pattern of dangerousPatterns) {
     if (sanitized.includes(pattern)) {
-      return {
-        valid: false,
-        error: 'Código do item contém caracteres não permitidos',
-      };
+      return {};
     }
   }

[Killed] ObjectLiteral
dadosCadastrais/informacoesGerais/validators/informacoesGerais.validators.ts:126:11
   // Tudo válido
   return {
     valid: true,
-    data: { itemCodigo: sanitized },
+    data: {},
   };
 }
killedBy: All tests
statusReason: > lor0138@1.0.0 test
> npm run test:unit



> lor0138@1.0.0 test:unit
> jest --testPathPattern=tests/unit
